{
    "5": {
        "title": "2017 BYOV Teaser Show",
        "description": "Join hosts Blue Star and Christian Kelty as they present live 2-minute teasers for many of the nearly 50 Bring Your Own Venue and Site-Specific offerings at the 2017 Fringe!",
        "img": "BYOV_450x450.png",
        "artist": "The Venue",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Language & Adult Themes"
        ]
    },
    "6": {
        "title": "2017 National &amp; International Artists Teaser Show",
        "description": "Join Hosts Chase Padgett and Michael Marinaccio as Fringe presents 2-minute live teasers for over 50 visiting shows from across the country and around the world!",
        "img": "2017NATNL-INT-TEASER_450x450.png",
        "artist": "Orlando Fringe",
        "artistLocation": "Orlando, FL"
    },
    "7": {
        "title": "2017 Orlando Fringe Closing Ceremonies and Awards",
        "description": "Join the staff and Artists of Orlando Fringe for a night of laughter, tears, awards, and honors as we say goodbye to the 2017 Orlando Fringe Festival!",
        "img": "2017Closing_450x450.png",
        "artist": "Orlando Fringe",
        "artistLocation": "Orlando, FL"
    },
    "8": {
        "title": "2017 Orlando Fringe Midnight Cabaret",
        "description": "A variety show like no other, where Artists perform previously unseen songs and skits, lit only by audience held flashlights! Hosted by Fringe icon Pepe.",
        "img": "OrlandoFringePresents_TheMidnightCabaret_450x450.png",
        "artist": "Orlando Fringe",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Strong Language",
            "Mature Themes",
            "Possible Nudity"
        ]
    },
    "9": {
        "title": "2017 Orlando Fringe Opening Ceremonies &amp; Ribbon Cutting",
        "description": "Join Fringe Staff, Board, and local dignitaries as we toast champagne and ring in the official start of the 2017 Orlando Fringe Festival!",
        "img": "2017OrlandoFringeOpening_450x450.png",
        "artist": "Orlando Fringe",
        "artistLocation": "Orlando, FL"
    },
    "10": {
        "title": "6 Quick Dick Tricks: A Dirk Darrow Investigation",
        "description": "From 8 time Fringe Fest Award Winning Magician Tim Motley, creator of 2 Ruby Knockers, 1 Jaded Dick&hellip;<br><br>★★★★★ &ldquo;Spellbound.&rdquo; - Australian Stage<br><br>A mind blowing mentalist collides with danger in an ALL NEW thrilling film-noir murder mystery adventure. This hilarious psychic detective with the winning smile puts on a killer show&hellip; literally.<br><br>★★★★★ &ldquo;Incredible mental abilities&rdquo; -Edmonton Journal",
        "img": "6QDT_450px.jpg",
        "artist": "Tim Motley",
        "artistLocation": "Melbourne, Australia",
        "warnings": [
            "Adult Themes",
            "Frequent Puns"
        ]
    },
    "11": {
        "title": "Alarm of the People",
        "description": "The Alarm of the People is a collection of WWII and Holocaust short plays. Each play focuses on a real historical figure and their exploits during this time. The collection includes four short plays about Nancy Wake and Hannah Szenes who were spies; Susan Turner, a woman who served in the armed forces; and Marcel Petiot, who committed atrocities under the title of spy. These people&rsquo;s stories have gone untold.",
        "img": "AlarmofthePeople_450.png",
        "artist": "White Mouse Productions",
        "artistLocation": "Tallahassee, FL",
        "warnings": [
            "Mature Themes",
            "Violence",
            "Strong Language"
        ]
    },
    "12": {
        "title": "Alignment",
        "description": "Life&rsquo;s simplest problems may have imbalanced or blocked us at our root. It is up to us to encounter ourselves to reach full alignment.<br><br>Violinist and cellist Jose Navarro, will take you on a deep journey through the chakras. This colorful adventure will highlight the meanings and challenges of each energy center.<br><br>Remember, the universe is perfect. Where there is light, there must be darkness. Try not to get lost in the rainbow.",
        "img": "ALIGNMENT_2017_450X450.png",
        "artist": "Navaro Performs",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Strong Language",
            "Mature Themes"
        ]
    },
    "13": {
        "title": "Alive: Music for Night of the Living Dead",
        "description": "A live film score to accompany the zombie classic, \"Night of the Living Dead\". In 1968, George Romero's stark, black &amp; white film shocked audiences, redefined horror, and launched the zombie genre. A mesmerizing, new score brings contemporary film scoring and intense sounds to the tradition of silent film. Under its flesh and gore, Romero's film is story that resonates still today; with Modern Robot, it's an experience to get under the skin.",
        "img": "alivelivingdead_2017_450x450-.png",
        "artist": "Modern Robot",
        "artistLocation": "Greensboro, NC",
        "warnings": [
            "Violence"
        ]
    },
    "14": {
        "title": "An Ordinary Life",
        "description": "Every little thing in life awaits our attention; attempting to teach us and prepare us for what comes next. But many of us are too busy waiting for the next big thing to happen. If we just pause and take notice, we will know why the bird sings.",
        "img": "AnOrdinaryLife_450.png",
        "artist": "Dennis Enos",
        "artistLocation": "Orlando, FL"
    },
    "15": {
        "title": "The Awokening",
        "description": "The Awokening is an original play written in response to the continued inequality women face in the world. As Margaret prepares to march for her equal rights, she faces opposition from her boyfriend, Brian, who doesn&rsquo;t understand the need to march. Margaret recounts her sexual experiences to try to illustrate the depth of the disparity between men and women. Throughout the journey Brian learns the truth about what it is like to be a woman today.",
        "img": "awokening_2017_450x450_ticketing.png",
        "artist": "Caitlyn Wisser",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Some strong language",
            "mature themes."
        ]
    },
    "16": {
        "title": "Baby with the Bathwater",
        "description": "As the play begins Helen and John gaze proudly at their new offspring, a bit disappointed that it doesn't speak English and too polite to check its sex. So they decide that the child is a girl and name it Daisy&mdash;which leads to all manner of future emotional and personality problems when it turns out that Daisy is actually a boy.",
        "img": "babywiththebathwater_2017_450X500.png",
        "artist": "We Wine A Lot Productions",
        "artistLocation": "Winter Springs, FL",
        "warnings": [
            "Strong Language",
            "Mature Themes"
        ]
    },
    "17": {
        "title": "BAKER'S DOZEN: 12 Angry Puppets",
        "description": "Rub-a-dub-dub, the Baker&rsquo;s dead in the tub! Now his husband the Butcher is on trial. And what ever happened to this mysterious Candlestick Maker?",
        "artist": "The Pucking Fuppet Co.",
        "artistLocation": "Toronto, Canada",
        "warnings": [
            "Strong language",
            "mature themes"
        ]
    },
    "18": {
        "title": "Balls of Yarns",
        "description": "6-time Best of Fest winner Paul Strickland&rsquo;s WEIRD-LARIOUS ONE-MAN MUSICAL ADVENTURE! David Lynch meets The Wizard of Oz. Songs! Yarns! Balls!<br><br>In a strange town where creaky doors sing with you, lie-braries are separate from truth-braries, and extraordinary stories are shared through yarn and tin can, an ominous lurking evil has threatened to make things normal. NOT ON PAUL STRICKLAND&rsquo;S WATCH. Jokes! More Yarns! Again, Balls!",
        "img": "BallsofYarns2.jpg",
        "artist": "Paul Stickland Presents",
        "artistLocation": "Covington, KY",
        "warnings": [
            "Very mild language"
        ]
    },
    "20": {
        "title": "Beau &amp; Aero: Crash Landing",
        "description": "16 time award-winning co. A Little Bit Off (Bella Culpa - Patrons&rsquo; Pick 2016) presents Beau &amp; Aero, an internationally renowned whirlwind of acrobatic and slapstick antics. Pilot Beau and his sidekick Aero - two bumbling aviators - have crash landed, and will try ANYthing to get back in the air. These foolish aeronauts live in a world where balloons are bountiful, laughs are abundant, and hardly a word is spoken. Come along for a flight of fancy.",
        "img": "BeauandAeroCrashLanding_450.png",
        "artist": "A Little Bit Off",
        "artistLocation": "Portland, OR",
        "warnings": [
            "Latex"
        ]
    },
    "21": {
        "title": "Beers About Songs",
        "description": "&lsquo;Beers About Songs&rsquo; communicates an underlying theme that will make you both laugh and cry. With personal stories and touching songs, it is guaranteed to make you open your eyes to the world of relationships.<br><br>&ldquo;Ryan Adam Wells is a master storyteller.&rdquo; &ndash; The Clothesline 5 Stars<br><br>&ldquo;Part song cycle, part stand up routine, it holds your attention all the way.&rdquo; &ndash; The Advertiser 4 Stars",
        "img": "BeersAboutSongs_2017_450px450p.png",
        "artist": "Ryan Adam Wells",
        "artistLocation": "Houston, TX",
        "warnings": [
            "Mature Themes"
        ]
    },
    "22": {
        "title": "Betty Betty (or Gee I Hope My Mom Doesn't See This Show)",
        "description": "A two-person twist on a family dramedy, written by John Mark Jernigan and directed by Chris Crawford, Betty Betty is the tale of one implausible friendship between two twenty something&rsquo;s trapped on the verge of &ldquo;something better,&rdquo; searching for some grace in all of life&rsquo;s bitter truths. Set in 1987 and 2008 Chicago with a kick ass 80&rsquo;s soundtrack, Betty Betty is making its world premiere in the Brown Venue.",
        "img": "bettybetty_2017_450x450pixel.png",
        "artist": "Intrepid Stage",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Strong Language",
            "Mature Themes"
        ]
    },
    "23": {
        "title": "Biblical Fan Fiction",
        "description": "Biblical Fan Fiction presents the Bible stories of Elisha and the Bears, John the Baptist, and Noah. Using humor, sketch-prov, video, children&rsquo;s art, and music, we tell the stories, fill in some blanks along the way and answer some questions the Bible doesn&rsquo;t. Is God bald? Where do babies come from? How good does a dance have to be to get someone&rsquo;s head chopped off? Was Noah the only guy with a boat? Why are there no unicorns?",
        "img": "Biblical-Fan-Fiction-450.jpg",
        "artist": "Charlie Griffin",
        "artistLocation": "Winter Park, FL"
    },
    "25": {
        "title": "The Bitch of Living: Teen Angst on Broadway",
        "description": "Being a teenager is hard! Using monologues and songs from Broadway musicals, The Bitch of Living: Teen Angst on Broadway shares the experiences, concerns, joys, and heartaches of modern teens. A cast of thirteen performs songs from Carrie, Bare, Spring Awakening, 13, American Idiot, Next to Normal, and more. The musical revue deals with such issues as sexuality, relationships, parent relations, school, friendship, self esteem, and depression.",
        "img": "TBOL_2017_450x600_72dpi.png",
        "artist": "Breathrough Theare of Winter Park",
        "artistLocation": "Winter Park, FL",
        "warnings": [
            "Strong Language",
            "Mature Themes"
        ]
    },
    "26": {
        "title": "Bitch, Perfect!",
        "description": "Inspired by a recent film with a [similar] title, &lsquo;Bitch, Perfect&rsquo; tells the story you didn&rsquo;t know you needed to hear! A young (gay) man discovers himself in the illustrious and competitive world of A Capella Singing! Exciting music, campy humor, a predictable gay love story, a little bit of heart, and Aca-Awesome A Capella humor combine to provide an evening unlike any other!",
        "img": "bitchperfect_2017_450x300.png",
        "artist": "Orlando Gay Chorus",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Strong Language",
            "Mature Themes"
        ]
    },
    "27": {
        "title": "The Black and the Jew Go Buddhist!",
        "description": "Epstein and Hassan (aka the Black &amp; the Jew) have been perfecting \"Black/Jew/Love Technology,&rdquo; their hilarious comedy show throughout their 30 years of marital bliss. (Yes we count the years)<br><br>The Black and the Jew go Buddhist is an intimate look inside their marriage that lead to the wisdom of \"Blackjewlove Technology\". Topics that Epstein and Hassan deal with are race, sex, religion, family and money.",
        "img": "theblackandthejewgobuddhistMax450xNoheight.png",
        "artist": "Epstein and Hassan",
        "artistLocation": "New York, NY",
        "warnings": [
            "Adult language"
        ]
    },
    "28": {
        "title": "BLACK IN THE BOX",
        "description": "Black in the Box follows a man that is able to embody and trace the steps of blacks from the slave era to current-day America through the use of masks. As the result of his immersion, the man gains insight and understanding as to why frustrations have grown within the black community. This revealing performance provides a profound and panoramic chronicle of the historic black experience.",
        "img": "BlackInTheBox_2017_450x650.png",
        "artist": "Marlon Andrew Burnley",
        "artistLocation": "Atlanta, GA",
        "warnings": [
            "Political Themes"
        ]
    },
    "29": {
        "title": "BLINDSIDE",
        "description": "After her recent European tour, one-eyed multiple BEST-OF-FEST winner is back to recount her life as a feisty 7 year-old who wields her glass-eye as a superpower.<br>Raw, hilarious and literally eye-popping!<br><br>★★★★★ &ldquo;EXPERT PHYSICAL COMEDY. IMPECCABLE TIMING.&rdquo; -CBC<br><br>★★★★★ &ldquo;EXTRAORDINARY.&rdquo; -Vue Weekly<br><br>★★★★★ &ldquo;INTOXICATING CRESCENDO OF LAUGHTER&rdquo; -Theater In London<br><br>★★★★★ ''PHENOMENAL AND NOT TO BE MISSED!'' -Inside Ottawa",
        "img": "BLINDSIDE_2017_450x450v02.jpg",
        "artist": "Stephanie Morin-Robert",
        "artistLocation": "Vancouver, Canada"
    },
    "30": {
        "title": "A Brief History of Petty Crime",
        "description": "The award-winning British comedian, storyteller and Fringe favourite Jimmy Hogg (Figgy Pudding, Curriculum Vitae) returns to discuss his life of petty crime. Physical, fast-paced, hilarious storytelling- with a car crash and plenty of tangents.<br><br>BEST OF FRINGE: Toronto, Montreal, Winnipeg, Minnesota, San Francisco, Ottawa, Boulder, Victoria.<br><br>&ldquo;Dickens would love this guy.&rdquo;- Elizabeth Maupin, Orlando Sentinel.<br><br>&ldquo;Charming, hilarious, remarkably energetic.&rdquo;- The Torontoist.",
        "img": "ABriefHistoryofCrime_450.png",
        "artist": "Jimmy Hogg",
        "artistLocation": "Toronto, Ontario, Canada",
        "warnings": [
            "Strong language"
        ]
    },
    "31": {
        "title": "Burning Man: Who Sold the World",
        "description": "A solo play, based on a TRUE story, mostly comedic and a sometimes very dark look into what makes contemporary American politics&hellip; tick. The burning man bearer of &ldquo;questionable news,&rdquo; bears strong political messages about the current American agenda-America versus the rest of the world and the rest of the world versus itself. He travels beyond death and through the stars ultimately finding himself on a distant planet, a dreamlike utopian society.",
        "img": "BurningMan_2017_72dpi-450x450.jpg",
        "artist": "David Ortolano",
        "artistLocation": "Boulder, CO",
        "warnings": [
            "Strong language",
            "Mature themes"
        ]
    },
    "32": {
        "title": "ButchQueen",
        "description": "ButchQueen is the tale of a washed up drag queen struggling through a life of long nights and Bad Habits. A production penned to shed light on the often misunderstood life of the aging artist, ButchQueen and the band give you a glimpse into their chaotic creative lifestyles. This short story takes the viewer on a turbulent ride of emotion, music, and madness. ButchQueen: a live drag rock extravaganza!",
        "img": "butchqueen_2017_450x450_72dpi.png",
        "artist": "ButchQueen & the Bad Habits",
        "artistLocation": "Lakeland, FL",
        "warnings": [
            "Partial nudity",
            "Adult language and theme"
        ]
    },
    "33": {
        "title": "Cabaret on the Rocks",
        "description": "The girls and boys of the Blacklist Babes Cabaret are returning to Orlando Fringe with their signature burlesque and live music fusion. A Blacklist cabaret show can be hilarious, disturbing, or dazzling--often all at once--but it is always a sexy night! The Blacklist Babes and their lovely band, the Pitches, are regulars at St. Matt&rsquo;s and the Venue, and pop up all over Central Florida, but for Fringe they&rsquo;re bringing a brand new show every night!",
        "img": "Cabaretontherocks_2017_450x320.png",
        "artist": "Blacklist Babes Cabaret",
        "artistLocation": "Orlando, FL"
    },
    "34": {
        "title": "California Kiki",
        "description": "California Kiki, is just a fun Cabaret show that you can have a drink and feel like you are talking with your best friend about all that life has to offer. Brett McMahon comes from a small Farm town and moves to Hollywood to become a Star. Little does he know there are obstacles of being home sick, falling in and out of love, drugs, sex, and most of all the world of theatre. The songs help tell the story perfectly and plenty of laughs. Come Kiki!",
        "img": "CaliforniaKiki_2017_450x450.png",
        "artist": "Brett McMahon",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Strong Laguage",
            "Nudity",
            "Sexual Themes"
        ]
    },
    "35": {
        "title": "Caws &amp; Effect",
        "description": "Crows are re-dreaming the world. Is the future all it's cracked up to be?<br><br>This modern fable is told using handmade layered projections, puppetry, masks, and an original musical score. Mind of a Snail's large-scale shadow puppetry is quirky, colorful and beautiful, like early animation performed live before your eyes.<br><br>The critics are RAVEN!<br><br>★★★★★ \"a gorgeous and wondrous work of art\" -CBC<br><br>★★★★★ &ldquo;a fantastical, unique experience&rdquo; -Torontoist",
        "img": "CawsAndEffect_450.png",
        "artist": "Mind of a Snail Puppet Co.",
        "artistLocation": "Vancouver, Canada"
    },
    "36": {
        "title": "Chameleon",
        "description": "'Peter' steps from 'backstage to 'play-space' as one of five different characters:<br><br>THEODORE, the old stage hand<br>BROTHER SOIR&Eacute;E, effeminate, superficial, fun<br>COLIN, an Irish singer<br>THE SPANISH GUY, gravitas and flash<br>TREVAYLIN WEST, Country Music Megastar<br><br>Take these five characters, throw in some satire, original music, pathos, and a lot of laughs, and we're in for an acerbic, pointed, and ultimately hopeful glimpse of the 'that' which is 'us'.",
        "img": "chameleon_2017_450w 72dpi.jpg",
        "artist": "Peter Suarez",
        "artistLocation": "Gulfport, FL"
    },
    "37": {
        "title": "Chase Padgett: 5 Stars",
        "description": "Chase Padgett (6 Guitars, Nashville Hurricane) brings another show that'll make you say, \"I guess that was worth 12 bucks.\" Filled with killer guitar music, singing and comedy, you'll see why Chase is one of the most successful performers across the entire Fringe Circuit. If you don't like it then your money back, guaranteed (no refunds, festival policy)<br><br>\"Chase Padgett doesn't need accolades anymore, but he still deserves them\" - Orlando Weekly<br><br>13 &amp; Up - Some Language, No nudity (your welcome)<br><br>60 minutes<br><br>Photo credit: Andy Batt Photography",
        "img": "Orlando5Stars.jpg",
        "artist": "Chase Padgett",
        "artistLocation": "Portland, OR"
    },
    "38": {
        "title": "Children's Hour",
        "description": "One of the great successes of this distinguished writer. A serious and adult play about two women who run a school for girls. After a malicious youngster starts a rumor about the two women, the rumor soon turns to scandal. As the young girl comes to understand the power she wields, she sticks by her story, which precipitates tragedy for the women.",
        "img": "ChildrensHour_2017_450x450.png",
        "artist": "Boone High School",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Strong Language"
        ]
    },
    "39": {
        "title": "Clive Long at the Pegasus Gay Filipino Karaoke Club",
        "description": "This semi-autobiographical spoof of Lady Day at Emerson's Bar and Grille features showtunes, pop hits, and stories from Clive Long (Keith Newhouse's \"coming out name\"). From childhood karaoke hit The Greatest Love of All (how did he not realize his sexuality at age 8?) follow Clive in his checkered karaoke past. Will Clive have a breakdown following in Lady Day's footsteps? You'll have to attend to find out!",
        "img": "CliveKaraoke_2017_450x450.png",
        "artist": "Actsoup Networks",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Strong Language",
            "Mature Themes"
        ]
    },
    "40": {
        "title": "Cody Clark: A Different Way of Thinking",
        "description": "Through stage magic and story, sleight of hand and journey of mind,<br>Cody will show you the world through his eyes.<br>An autistic child transformed by magic.<br>Sharing his story at the fringe.<br>Maybe you&rsquo;ll find that his way of thinking isn&rsquo;t all too different from yours.",
        "img": "CodyClarkDiffWay_2017_450X450DPI72.jpg",
        "artist": "Cody Clark",
        "artistLocation": "Louisville, KY"
    },
    "41": {
        "title": "Commencement",
        "description": "&ldquo;Commencement looks into the heart of tragedy and stabs it.&rdquo;-NYtheatre.com<br><br>&ldquo;Brace Yourself&rdquo;-Edmonton Journal<br><br>A hauntingly deep exploration of the lives of three women drawn together in the aftermath of a high school shooting&mdash;the mother of the shooter (Beth Marshall), one of the shooter's victims (Rose Helsinger), the mother of that victim (Jamie Middleton). A timely lesson in empathy leaving the audiences with greater understanding. #onelove",
        "img": "Commencement_2017_450x450pixels.jpg",
        "artist": "Beth Marshall Presents",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Adult Themes",
            "Mild Language",
            "Violence"
        ]
    },
    "42": {
        "title": "Confessions of a Pear-Shaped Pupil",
        "description": "Andrew Mondia brings Shakespeare into his life story in this live variety one-man show exploring To See or Not too See, All the World&rsquo;s a Stage and Oh Romeo am I in love with this guy? Paying tribute to his late Grandfather who inspired him on the path he is on now. Exploring and delving into childhood abuse, school bullies and exploring his own self and sexuality. Come live vicariously through song, poetry, acting and dancing in Confessions of a Pear-Shaped Pupil!",
        "img": "COPP_Orlando2017.450.jpg",
        "artist": "Andrew Mondia",
        "artistLocation": "British Columbia, Canada",
        "warnings": [
            "Mature Themes"
        ]
    },
    "43": {
        "title": "Corsets and Cuties - A Burlesque Cabaret - #flawless",
        "description": "Corsets &amp; Cuties are back for round 3 of Fringe in an all-new review. Listed among the Best of Orlando Burlesque (Orlando Weekly), the Cuties are celebrating the best of the City Beautiful bringing their unique mix of talent &amp; cheeky humor to the stage. Sponsored by Premier Couples Superstore, audiences have the chance to win fun take home prizes. With a different guest star featured each show- we invite you to see why the Cuties are #flawless.",
        "img": "C&C-Flawless_Logo-450x315.jpg",
        "artist": "Corsets and Cuties- LLC",
        "artistLocation": "Casselberry, FL",
        "warnings": [
            "Nudity",
            "Sexual Content"
        ]
    },
    "44": {
        "title": "Coupled: The Musical",
        "description": "Three couples share a weekend getaway in this hilarious musical which takes a comedic look at love, friendship and long term relationships. From the women's view of \"The Handiman\" to the men's plea of \"Help Me Oprah.\" Broadway World calls it \"...a lively, fun yet moving musical that fits the much needed niche between the young marrieds in \" I Love You, You're Perfect, Now Change\" and the older \"Menopause the Musical Ladies\".",
        "img": "Coupled_2017_450x300.png.png",
        "artist": "DFYENT Productions",
        "artistLocation": "Oviedo, FL",
        "warnings": [
            "Adult Themes"
        ]
    },
    "45": {
        "title": "Dandy Darkly's Myth Mouth!",
        "description": "Brooklyn's cult storytelling sensation, Dandy Darkly, makes his Orlando Fringe debut with his latest show focused on religion, addiction and social media obsession via satirical tales concerning a junkie Persephone, space-pup Laika, virtual reality fixation and humanity's premiere popinjay, Cha-Cha the Caveman.<br><br>\"Engrossing, twisted, sequined!\" ★★★★★ - Grumpy Gay Critic, London.<br><br>\"Unlike anything else at the Fringe.\" ★★★★ - The Scotsman, Edinburgh",
        "img": "DandyDarklysMythMouth_OF2017_450x633-72dpi.png",
        "artist": "Dandy Darkly",
        "artistLocation": "Brooklyn, NY",
        "warnings": [
            "Strong Language",
            "Mature Themes"
        ]
    },
    "46": {
        "title": "The Devil",
        "description": "From critically acclaimed comedian Mike Delamont, the creator and star of God Is A Scottish Drag Queen comes an all new character and the world premiere of an all new show! Fans of 'God' will finally get to meet The Devil and hear the other side of the story as Satan himself takes on everything the gays to the gospels in an unforgettable hour of comedy. Hell has never been this funny!",
        "img": "TheDevil_2017_450x450.png",
        "artist": "Mike Delamont",
        "artistLocation": "Victoria, British Columbia, Canada",
        "warnings": [
            "Course Language",
            "Adult Content"
        ]
    },
    "47": {
        "title": "DOG SEES GOD",
        "description": "Dog Sees God:Confessions of a Teenage Blockhead is a play written by Bert V. Royal. An \"unauthorized parody,\" the play imagines characters from the popular comic strip PEANUTS as degenerate teenagers. When CB's dog dies from rabies, CB begins to question the existence of an afterlife. His best friend is too burnt out to provide any coherent speculation; his sister has gone goth; his ex-girlfriend has recently been institutionalized; and his other friends are too inebriat",
        "img": "Dog_Sees_God_2017_450wide.jpg",
        "artist": "Lake Howell High School",
        "artistLocation": "Winter Park, FL",
        "warnings": [
            "Strong Language"
        ]
    },
    "48": {
        "title": "Douchenozzle",
        "description": "Felicia and Dori have created their own musical act to spray their message of gender-free insults across the land. Instead of taking back the night, they&rsquo;re re-claiming the dictionary by taking old words and giving them fresh, new meanings. A comedic look at how we talk about women (and men) and what those words ACTUALLY mean. It&rsquo;s the &ldquo;cleanest&rdquo; show at the Fringe! Created by the authors of Oedipus for Kids! and The Joys of Sex.",
        "img": "Douchenozzle_2017_450px Wide.png",
        "artist": "Rake Theater",
        "artistLocation": "Boynton Beach, FL",
        "warnings": [
            "Mature Anatomical Slang & Mature Themes"
        ]
    },
    "49": {
        "title": "Duel!",
        "description": "Nat and Will had one job: to tell the story of Alexander Hamilton and Aaron Burr&rsquo;s infamous duel. Unfortunately for Hamilton, they are not very good at their job. One misfired shot and chaos ensues. Burr becomes a pyromaniac. Eliza saves the day. An alligator makes an appearance. Who leaves the stage alive? Find out in this hilarious take on the event that ALSO inspired Lin-Manuel&rsquo;s little-known rap musical. (You probably haven&rsquo;t heard of it.)",
        "img": "Duel!_ 2017_450px450p.png",
        "artist": "The Narrative Union",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Comic/Cartoon Violence"
        ]
    },
    "50": {
        "title": "Evacuated!",
        "description": "Forced to flee Indonesia&hellip; the award-winning true story of a strange girl in a beautiful land. By 2014&rsquo;s Best Female Performer.<br><br>&ldquo;A fascinating true story&hellip; Creatively presented and beautifully written, this is Fringe fare at its best.&rdquo;<br>- FringeReview.ca<br><br>&ldquo;She speaks of Indonesia with such vivid description and feeling, it&rsquo;s easy to fall in love with the place even if you&rsquo;ve only traveled there through her words.&rdquo;<br>- StarPhoenix",
        "img": "ErikaKateMacDonald-Evacuated-WinterMiniFest.jpg",
        "artist": "Paul Strickland Presents",
        "artistLocation": "Covington, KY",
        "warnings": [
            "Mature Language"
        ]
    },
    "51": {
        "title": "Everything I Need to Know I Learned From Ethel Merman",
        "description": "\"Everything I Need to Know I Learned From... Ethel Merman\" is a 60-minute musical extravaganza coming to the Blue Venue of Orlando Fringe 2017. Taking a hint from the popular book, this show explores the ABCs of survival in the adult world by following the wisest Diva of them all: Ethel Merman! Come along on a showtune-filled, laughter inducing, &ldquo;one-man show&rdquo; about growing up gay in a Pentecostal household in the bible belt where his only saviors were community theater, an old record player, and the vinyl recordings of Broadway&rsquo;s greatest diva!",
        "img": "EverythingINeedtoKnowILearnedfromEthelMerman_2017_450x543.png",
        "artist": "Chrickey Productions",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Adult Situations",
            "Off-Color Humor"
        ]
    },
    "52": {
        "title": "Exit Through the D*ck Shop",
        "description": "No longer restricted by the chains of a pesky confidentiality agreement, Lucas is ready to answer all of your burning questions about his past profession as a dildo peddler. In this sort-of tell-all but-not-really, he addresses all of the misconceptions about sex that surprisingly still exist, what life is really like as an expert of sex, and all of the gadgets that you desperately need in your life. And by 'life', he means butt. Obviously.",
        "img": "ExitThroughtheDickShop_2017_450x253.jpg",
        "artist": "Intellectual Homosexual Productions",
        "artistLocation": "Boston, MA",
        "warnings": [
            "Adult Language and Themes"
        ]
    },
    "53": {
        "title": "Falkland",
        "description": "Under the starry blanket of night two unlikely friends, an idealistic young recruit and a reluctant farmer turned Captain, find a new camaraderie as the big show plays out in the theatre of war surrounding them. Bitter conflict, questionable politics, and moral debate engage us in a traumatic, but necessary, journey through the lives of the two men and the many twists and turns they encounter on the road to redemption.",
        "img": "Falkland_2017_450x450x72dpi.jpg",
        "artist": "Tasty Monster Productions / Luke Tudball",
        "artistLocation": "Wlborne, Norfolk, United Kingdom",
        "warnings": [
            "Strong Language",
            "Mature Themes",
            "Violence"
        ]
    },
    "54": {
        "title": "Ferris Bueller's Day Off: The Unofficial Musical",
        "description": "Ferris Bueller is BACK! Based on the classic teen comedy, Ferris Bueller's Day Off: The Unofficial Musical brings all your favorite characters to the stage in a fully fledged new show. Featuring original music by Tony Smith, choreography, and an original book based on the hit movie. So join us for the premiere at the Orlando Fringe Festival and remember: \"Life moves pretty fast. If you don't stop to look around once in a while, you could miss it.\"",
        "img": "FerrisBueller_2017_450x283.PNG",
        "artist": "Robert Johnston and Katie Ford",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Mild Language and Mature Themes"
        ]
    },
    "55": {
        "title": "Field Zoology 101",
        "description": "From the untamed wilds of the Orlando County Landfill, to the loading bay behind the Burger King, Field Zoologist Brad Gooseberry has seen it all. In this introductory course he shares a lifetime of \"knowledge\" and \"experience,\" teaching you to thrive and survive in the harrowing world of field zoology.<br><br>Favourite Comedy - 2016 Victoria Fringe Festival<br><br>\"Raucously funny\" - Showbill.ca",
        "img": "FieldZoology_2017_450x380.png",
        "artist": "Shawn O'Hara",
        "artistLocation": "Victoria, British Columbia, Canada",
        "warnings": [
            "Strong Language",
            "Mature Themes"
        ]
    },
    "56": {
        "title": "Firing My Bass Teacher",
        "description": "The mind behind Fringe shows \"Julie Bunny Must Die\", \"Fosgate: Ferret Loan Officer\", \"TJ &amp; Mr. Oaksite\" and \"Rhubarb The Bear\" steps forward in his first solo show as himself. Performing on as many of his instruments as will fit on stage (not to mention storage), he shows how learning each one opened up new possibilities, how one instrument in particular took him further than the others, and when to listen to your teachers - and when not to.",
        "img": "BassTeacher_2017_450x450.png",
        "artist": "Mental Multirack Productions / Ned Wilkinson",
        "artistLocation": "Winter Park, FL"
    },
    "57": {
        "title": "Flori-DUH",
        "description": "<strong>&ldquo;Florida Man claims wife kidnapped by holograms!&rdquo;</strong><br><br>The 2016 <strong>sold out</strong> fringe fundraiser returns with all new, completely true, stories and tales from the great state of Florida.<br><br>Hosted by fringe favourite <strong>Mike Delamont</strong> (<em>God Is A Scottish Drag Queen</em>) and sidekick <strong>Morgan Cranny</strong>, and featuring some of the best performers at the fest, this is <span style=\"text-decoration: underline;\"><strong>a one night only show</strong></span> to see!<br><br><strong>&ldquo;Florida woman steals 850 pairs of underwear from Victoria Secret!&rdquo;",
        "img": "Floriduh_2017_450x450.png",
        "artist": "Orlando Fringe",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Strong Language and Mature Themes"
        ]
    },
    "58": {
        "title": "Forget Me Not - The Alzheimer's Whodunnit",
        "description": "Jim&rsquo;s wife, a patient on a dementia ward, has died from what appears to be natural causes. Jim is a retired police detective and he smells a rat. He&rsquo;s determined to solve one last murder. The problem is he also has dementia. It&rsquo;s a case worthy of the greatest detective mind. But his will have to do.<br>Written &amp; performed by comic, poet &amp; ex-psych nurse Rob Gee<br><br>&ldquo;Hilarious and heartbreaking\" Victoria Times<br><br>\"A disturbing masterpiece\" Gig City, Alberta",
        "img": "ForgetMeNot_450x450.png",
        "artist": "Rob Gee",
        "artistLocation": "Leicester, United Kingdom"
    },
    "59": {
        "title": "Fringe Family Feud",
        "description": "We asked 100 Fringe artists to be part of our show. Will it be Magicians vs Canadians? Drag Queens vs Lutherans? Mimes vs Mamet? Different teams every show.<br><br>Teams answer our survey questions, like: \"What's the strangest thing you've ever seen at Fringe?\"<br>Who will give the top answer AND win prizes for some lucky audience members?<br><br>Jester Theater is back with their twist on this classic game show. Hosted by audience favorite Jay Hopkins.",
        "img": "Fringe_Family_feud_450x450.jpg",
        "artist": "Jester Theater",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Innuendo",
            "Mild Language"
        ]
    },
    "60": {
        "title": "Fruit Flies Like a Banana: World Tour",
        "description": "&ldquo;Fruit Flies&rdquo; returns with a madcap trip around the globe. YOU choose the itinerary! This high-octane variety hour combines music, theatre &amp; dance, with each piece inspired by a different locale. It&rsquo;s sure to keep your seats in their fully upright and locked positions!<br><br>&ldquo;★★★★★ Serious music by seriously talented musicians in a show that doesn&rsquo;t take itself seriously at all.&rdquo; &ndash;CBC.<br><br> &ldquo;★★★★★&rdquo; &ndash;Winnipeg Free Press.<br><br>Patron&rsquo;s Pick, Orlando Fringe 2016.",
        "img": "FruitFlies_2017_450x450_72dpi.png",
        "artist": "The Fourth Wall",
        "artistLocation": "Boston, MA"
    },
    "61": {
        "title": "Future Legend",
        "description": "This sci-fi rock musical explores our world through the eyes of an alien rockstar, who has come to Earth to change it in ways we could hardly imagine. Inspired by the music and work of David Bowie, written by Corey Volence (Space, Key of E), and starring Tod Kimbro (Dumpster Cats, Blue and Tod: In the Black), Future Legend is a psychedelic trip through the cosmos and beyond reality itself.\"",
        "img": "FutureLegend_2017_450x450.jpeg",
        "artist": "Prospero Theatre Company",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Language",
            "Content"
        ]
    },
    "62": {
        "title": "Gay Jeopardy",
        "description": "The F Word for $100 please&hellip; It's fierce, fabulous, flashy, festive and filthy. What is the most FUN you'll have at The Fringe?&rdquo; You&rsquo;ll find it here in this raucous, decadent, no-holds-barred romp through gay pop culture categories where nothing is too taboo and no topic is off the table! It&rsquo;s ALL tea and ALL shade lead by a boozed-up game show host (with an affection for sequins and a strong martini), two kitschy queens, and one southern televangelist's wife. Come find out who ends up on top and who bottoms. Not your Grandma's game show!",
        "img": "GayJeopardy_2017_450x700_72dpi.png",
        "artist": "Unseen Images Theare",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Nudity",
            "Strong Language",
            "Mature Themes"
        ]
    },
    "63": {
        "title": "Gertrude Stein Has Arrived!",
        "description": "Meet the woman who banished James Joyce, reinvented the word GAY, drank victory tea on Hitler's balcony with the Allied soldiers, and was quoted more often than Eleanor Roosevelt. When Gertrude and Alice sailed into New York harbor in October of 1934, after a 30-year absence from America, Times Square blinked GERTRUDE STEIN HAS ARRIVED and here she is!",
        "img": "GertrudeSteinHasArrived-450x450-72dpi-mobile.png",
        "artist": "Betty Jean Steinshouer",
        "artistLocation": "St. Petersburg, FL",
        "warnings": [
            "LGBT Content"
        ]
    },
    "64": {
        "title": "The Great & Powerful Tim: Magic to the Future",
        "description": "A comedy magic show with a plot! When an accident sends an unconfident magician's assistant back through time, does he have the courage to do a show on his own and generate enough magic to get back to the future? Originally from Orlando, this is Tim&rsquo;s 5th consecutive Fringe appearance. He is a member of the Magic Castle in Los Angeles",
        "img": "magictothefuture_2017_450x633-72DPI.png",
        "artist": "The Great & Powerful Tim",
        "artistLocation": "Los Angeles, CA",
        "warnings": [
            "Adult Content"
        ]
    },
    "65": {
        "title": "Go Fish",
        "description": "A new musical by Orlando Fringe veterans Brandon Roberts and Lindsay Taylor, with music by Cesar De La Rosa, that tells the journey of two goldfish and their struggles with friendship, forgetfulness, and avoiding getting flushed.",
        "img": "gofish_2017_450xnoheightlimit.png",
        "artist": "Lil Theatre Company",
        "artistLocation": "Orlando, FL"
    },
    "66": {
        "title": "The Hamlet Project",
        "description": "Three actors give a tour de force performance creating sixteen characters, and transport the audience right into the middle of this timeless tale. Combining Shakespeare&rsquo;s text with music, imagination, and maybe even a little help from you, we&rsquo;ll take you on a journey that will offer you a new understanding of this astounding story. The Hamlet Project, conceived and adapted by Chris Crawford, is a MUST SEE theatrical event in the Brown Venue.",
        "img": "thehamletproject_2017_450x650pixel.png",
        "artist": "JMJ Productions",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Mature Themes"
        ]
    },
    "67": {
        "title": "Help! I'm American",
        "description": "&ldquo;Help! I&rsquo;m American!&rdquo; is a brand new sketch comedy show from Los Angeles comedian, DK Reinemer, who is returning to the Fringe Festival circuit with this high-energy only-slightly-political show about love, the sinking of the Titanic, and wishing to be Canadian.<br>Mr. Reinemer&rsquo;s credits include: &ldquo;The DK and Morgan Show&rdquo; (SF SketchFest), &ldquo;100% Stuff&rdquo; (Austin SketchFest); as well as the Chicago, Seattle, and Vancouver international improv festivals.",
        "artist": "DK Reinemer",
        "artistLocation": "Los Angeles, CA",
        "warnings": [
            "Some Mature Themes",
            "Improvisation"
        ]
    },
    "68": {
        "title": "The Hidden Tears Project presents RED",
        "description": "RED is a dance theatre show about surviving the darkest human experiences and the joy that comes from living through them. Contemporary dancers perform with fabric, while actors read real accounts from male and female survivors of sexual abuse. The piece tells the story of triumph as we face our demons, ourselves and the world. It is a seamless journey through the emotional process of healing and through it we too are changed.",
        "img": "RED_2017_450 wide.jpg",
        "artist": "Marinov Dance",
        "artistLocation": "Venice, CA"
    },
    "69": {
        "title": "High Tea: Another British Comedy",
        "description": "&ldquo;OUTRAGEOUSLY FUNNY&rdquo; (★★★★★ London Free Press).<br><br>England&rsquo;s 16-time BEST-OF-FEST winners, recipients of London&rsquo;s Most Outstanding Production and Impresario Award and 2016 Canadian Comedy Award, James &amp; Jamesy (of 2 for Tea) accidentally flood the world with tea, and cling to their friendship and imagination to stay afloat.<br><br>High Tea is an &ldquo;irresistible&rdquo; (★★★★★ Torontoist) comedy by &ldquo;one of the most popular Fringe duos ever&rdquo; (★★★★★ CBC).",
        "img": "HIGH_TEA_POSTER_450px.png",
        "artist": "James & Jamesy",
        "artistLocation": "Sussex, England"
    },
    "70": {
        "title": "In Plain Sight",
        "description": "High school sucks, am I right? But Winston, the painfully shy boy with a stutter, and<br><br>Chris, the deaf girl who&rsquo;s new in town, are having an especially hard time. They find each other online in a superhero chatroom and develop a fast friendship and flirtation. But what happens when they discover that the people behind the screens aren&rsquo;t quite the perfect ones they created online?",
        "img": "inplainsight_2017_450x300.png",
        "artist": "Lake Nona High School",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Mild sexual content",
            "Strong Language",
            "and Prejudice/Intolerance."
        ]
    },
    "71": {
        "title": "Joan Crawford's House Party",
        "description": "She's Back! Doug Ba'aser revives his untouchable Joan Crawford impersonation in this &ldquo;Favorite Fringe Show&rdquo; award winner. Joan and Christina share the stage with dancing gay boys! You never know who might drop by! Liza? Adele? Kelly Ann? Cocktails will be served &amp; prizes will be given away! The costumes alone will blow you away. One thing is certain: you&rsquo;ll never be the same after seeing this show! Come see it, I lost 40 lbs. for you bitches!",
        "img": "JoanCrawford_2017_450x450.png",
        "artist": "Doug Ba'aser Presents",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Cocktails will be served"
        ]
    },
    "72": {
        "title": "Joe's NYC Bar",
        "description": "Fringe favorite returns after a tour of Edinburgh and NYC! Joe's is an immersive, interactive experience set in a bar in Brooklyn, NY.",
        "img": "JoesNYCBar_450.jpg",
        "artist": "Beckett Thomas Productions",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Strong Language",
            "Mature Themes"
        ]
    },
    "73": {
        "title": "John &amp; Jen",
        "description": "From composer Andrew Lippa, best known for music and lyrics of Broadway musicals such as \"The Addams Family,\" \"Big Fish\" and \"The Wild Party,\" comes a clever and playful musical about a brother and sister, at different ages and stages in their lives. They play, tease each other, and at times argue; while also engaging concepts of togetherness, social freedom, and the true meaning of family.",
        "img": "JOHN AND JEN_2017_450x450.png",
        "artist": "Cat Scratch Players",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Mature Themes"
        ]
    },
    "74": {
        "title": "Judy Garland: Stuck in a Bear Trap with Nothing to Wear",
        "description": "Solo improviser makes up a 30 minute monologue playing later-in-life Judy Garland.",
        "img": "judygarland_2017_450x900.jpg",
        "artist": "Judy Garland",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Language",
            "Situations"
        ]
    },
    "75": {
        "title": "#KanderAndEbb",
        "description": "With critical/audience acclaim in NYC, Toronto, and Montreal, #KanderAndEbb is a hilarious and touching tour-de-force from a lifelong fan who managed to get close to legendary Broadway songwriters John Kander &amp; Fred Ebb's world. Discover their unique writing process, what it's like to be in a rehearsal studio with Liza Minnelli, and more as cabaret star Ryan G. Hinds performs songs from THE VISIT, CABARET, KISS OF THE SPIDER WOMAN, CHICAGO, etc.",
        "img": "KANDERANDEBB_2017_450x450-72dpi.png",
        "artist": "colored lights / Ryan G. Hinds",
        "artistLocation": "Toronto, Ontario, Canada",
        "warnings": [
            "Some Mature Themes"
        ]
    },
    "76": {
        "title": "La Reina Yolanda",
        "description": "Meet Yolanda, a fierce Latina who we follow from childhood to old age. Beset by tragedy, she leans on her sharp mind and family to land on her feet. An advocate for her family and the less fortunate, her mind becomes ravaged by Alzheimer's. She's faced with the fight for her mind,sense of self and the family she has fought hard to protect. When who we are begins to disappear piece by piece, how do we hold on to the essence of what defines us.",
        "img": "LRY-ProgramIcon-4x4_copy.jpg",
        "artist": "Leesa Castaneda",
        "artistLocation": "Winter Park, FL"
    },
    "77": {
        "title": "The Ladies and Lady Boys of the Peek-a-Boo Lounge",
        "description": "The Award Winning Ladies of The Peek-a-Boo Lounge get DOWN and DIRTY and dance out your sexual frustrations This one night only show of DANCE, DEBAUCHERY and apparatus's will leave you having very grown up feelings.",
        "img": "peekaboo_2017_450x450.png",
        "artist": "BlueLALA Entertainment",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Nudity",
            "Sexual Content"
        ]
    },
    "78": {
        "title": "The Last 5 Years",
        "description": "An emotionally powerful and intimate musical about two New Yorkers in their 20s who fall in and out of love over the course of 5 years, the show's unconventional structure consists of Cathy, the woman, telling her story backwards while Jamie, the man, tells his story chronologically; the two characters only meet once, at their wedding in the middle of the show. (Also an Anna Kendrick and Jeremy Jordan film, but this is way better.)",
        "img": "TheLastFiveYears_2017_450x675-75dpi.png",
        "artist": "Really Spicy Opera",
        "artistLocation": "Minneapolis, MN",
        "warnings": [
            "Strong Language"
        ]
    },
    "79": {
        "title": "Leash Your Potential",
        "description": "Drawing on 15+ years of experience at a fortune 500 company, Ryan will teach you how to succeed in a modern corporate bureaucracy, where outdated notions like talent, competence and hard work are irrelevant. Topics will include: being an effective participant in ineffective meetings, sending unreadable email, and gaming metrics.",
        "img": "leashyourpotential_2017_450x450.png",
        "artist": "Ryan Gunther",
        "artistLocation": "Vancouver, British Columbia, Canada",
        "warnings": [
            "Some swearing"
        ]
    },
    "80": {
        "title": "Let Go: Dance Theater Production",
        "description": "Who is the master of YOUR mind? Let Go cracks the human condition wide open-offering the audience a chance to self-reflect. Inspired by the overwhelming reactions of self-defeat, the voices in our heads, and the inner strength we find along the way. We come together to Let Go.",
        "img": "LetGo_2017_450x450.png",
        "artist": "Amanda Cox",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Mature Themes"
        ]
    },
    "81": {
        "title": "Life Below Zero",
        "description": "Struggling with the torment of a mistake he made four years prior, Jonathan, an Army Veteran, has pushed away all who care for him. His wife, his parents, and his lifelong friend have all tried&hellip; and failed&hellip; to bring him back to a life worth living. Through a set of seemingly unreal circumstances, Jonathan has now met with a mysterious man named Michael; who may be his last chance.",
        "img": "TEEN-LifeBelowZero_450x450.png",
        "artist": "Spruce Creek High School",
        "artistLocation": "Port Orange, FL",
        "warnings": [
            "Strong Language",
            "Violence",
            "Mature Themes"
        ]
    },
    "82": {
        "title": "Living Room, The Sitcom",
        "description": "Plug in your VCR! It's 1996 and sitcom pilots are being created left and right. What about the shows that just don't make the cut?<br><br>Living Room, The Sitcom is about the shooting of a problematic pilot that is trying to follow Seinfeld&rsquo;s time slot. Get ready for a whole new theatrical experience as you watch this sinking ship try to stay afloat.<br><br>Living Room, The Sitcom is an immersive experience that is plugged in with 90&rsquo;s humor and the art of creating a television sitcom. The only question remaining is what will break first? The actors, the crew or the set itself.",
        "img": "LivingRoom_450x450.JPG",
        "artist": "Whisper Entertainment",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Strong Language",
            "Mature Themes"
        ]
    },
    "83": {
        "title": "LOCI",
        "description": "LOCI is an evening-length composition for solo drum set and interactive electronics created to explore the symbiotic possibilities of acoustic and electronic sound. The work is entirely improvised in real-time; the electronics create material using random numbers or from sonic information gathered by two microphones. These generated sounds inform the performer&rsquo;s improvising, resulting in an irreproducible conversation of acoustic and electronic.",
        "img": "LOCI_2017_450x677.png",
        "artist": "Sean Hamilton",
        "artistLocation": "Tampa, FL"
    },
    "84": {
        "title": "LOL LOL Land",
        "description": "The world is crazy.<br><br>Instead of trying to keep up with the hectic mess you COULD travel to an enchanted place where people sing about life's struggles and dance all their cares away. But even then your feet would tire before your netflix and chillin' body lost it's voice from belting the high D's. So here's your solution: a comedy show with no rules and great laughs that you don't have to work for.<br><br>LOL LOL Land is written and performed by the Daisy Players: Candace, Dan, Holly &amp; Kelly",
        "img": "LolLolLand_450x450.JPG",
        "artist": "Daisy Productions",
        "artistLocation": "Ontario, Canada",
        "warnings": [
            "Strong Language"
        ]
    },
    "85": {
        "title": "Looking To Upgrade",
        "description": "Why are we here? What happens when we die? Is it safe to hand wash cashmere? Funny lady Lisa Pedace mixes stand-up comedy, cabaret and more as she tackles life&rsquo;s BIG questions &amp; lots of little ones too. Also some medium-sized questions.<br><br>WINNER - Outstanding World Premiere - San Diego International Fringe.",
        "img": "LookingToUpgrade_2017_450x450.png",
        "artist": "Lisa Pedace",
        "artistLocation": "San Diego, CA",
        "warnings": [
            "Adult Themes and Laguage"
        ]
    },
    "86": {
        "title": "Love Hertz",
        "description": "The hilarious adventures of a man and an antique radio that fall in love! Mark Twain meets the Brothers Grimm meets Pee Wee Herman in this sillier-than-thou musical comedy brought to you by the oddest couple of fringe favorites, Paul Strickland (Papa Squat) and Brandon Roberts (Sport, Stump). A time machine, a waiting room building factory, a minister who preaches fairy tales, and more! Tune in to a show so delightful, weird and funny it must be seen to be believed!",
        "img": "LoveHertz_2017_450X450pixels 72dpi.png",
        "artist": "Tate Street Productions",
        "artistLocation": "Greensboro, NC",
        "warnings": [
            "Immature Themes and Tolerant Ideas"
        ]
    },
    "88": {
        "title": "The Man From Earth",
        "description": "A man strikes his friends and colleagues with a fantastic revelation: he is a 14,000 year-old immortal, who has survived from the Cro-Magnon Era to the present. His earth-shaking assertion challenges the group on spiritual, scientific and historical levels. But the most incredible is yet to come - an astonishing truth that shakes the very core of what we believe about our own history and culture.<br><br><strong>Performed in a real Living Room!</strong><br><br><span style=\"text-decoration: underline;\"><strong><span style=\"color: #800080; text-decoration: underline;\">Please note that since this performance takes place in a personal residence and not a commercial performance space, it may not be accesibly by people with disabilities. </span></strong></span>",
        "img": "ManFromEarth_2017_450x450.png",
        "artist": "Homicidal Orphan Productions",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Strong Language and Adult Content"
        ]
    },
    "89": {
        "title": "Mark Toland, Mind Reader",
        "description": "Mark Toland knows what you're thinking and proves it in this fast-paced, mind blowing show. As the \"Top Booked Mind Reader in the US &amp; Canada\" he has amazed some of the largest companies in the world including McDonald's, Pepsi, Bentley, Dos Equis, Disney, and more. Now it's your chance to find out if he can read your mind, too!",
        "img": "MarkTolandMindReader_2017_450x450.jpg",
        "artist": "Mark Toland",
        "artistLocation": "Chicago, IL",
        "warnings": [
            "Adult Themes and Language"
        ]
    },
    "90": {
        "title": "Martin Dockery: Delirium",
        "description": "The ridiculous, true story of a search for meaning amidst love, loss, and butterflies at The Top of the World.<br><br>&ldquo;A deliriously good show.&rdquo; &ndash;CBC.<br><br>WINNER: 2014 (The Surprise) &amp; 2015 (Moonlight After Midnight) Critics Pick Best Show.<br><br>\"Martin Dockery knows how to spin even the most common occurrence into a gripping yarn &ndash; a trick the best stand-ups display. The vibrant New Yorker delivers his tales with verve, wit and insight.\" &ndash;Chortle, London (UK).",
        "img": "Delirium_2017_ 450x450pixel.jpg",
        "artist": "Concrete Drops",
        "artistLocation": "Brooklyn, NY"
    },
    "91": {
        "title": "Masquerade of the Red Death: A Dark Burlesque Fantasy",
        "description": "His excellence, Prince Prospero, cordially invites you to his deviant masquerade. Join us in the grand abbey, far from the pestilence of the outside world, to revel in safety and depravity within its illustrious halls.<br><br>Big Bang BOOM! Cabaret presents a dark burlesque fantasy.",
        "img": "masque-of-the-red-death-2017-450x550.png",
        "artist": "Big Bang BOOM! Cabaret",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Nudity",
            "Sexual Content"
        ]
    },
    "92": {
        "title": "Mean Old Kitty Face",
        "description": "Fringe veteran Marcie Schwalm, creator of the critically-acclaimed Fringe hit \"Boogie Shoes\", returns with a new one-woman show about imaginary enemies. Heavy theological questions such as \"What does your soul look like?\" will be answered. Baloney will be stolen, babies will be drop-kicked. There might be some tap dancing. And Kitty Face will try to ruin everything. Mean old Kitty Face!",
        "img": "MeanOldKittyFace_2017_Max450.png",
        "artist": "Quiet Desperation Production / Marcie Schwalm",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Some Strong Language and Adult Themes"
        ]
    },
    "93": {
        "title": "The Merelee Players",
        "description": "James is a delusional man in his mid-thirties who wants nothing more than to own a legitimate theater. After drunkenly submitting for a lucrative grant, he is forced to use his family and some newly met acquaintances to stage an over-the-top original play. As the company struggles to realize James' bizarre vision, their relationships are put to the test as seemingly everything goes wrong around them.",
        "img": "The Merelee Players_2017_450x450.png",
        "artist": "Scoot Scoot Productions",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Strong Language"
        ]
    },
    "94": {
        "title": "The Merkin Sisters",
        "description": "\"EXPERT PHYSICAL COMEDY\"-CBC.<br><br>&ldquo;Unbelievably charismatic&rdquo;-CharleboisPost.<br><br>From Creators of SOLD OUT shows Little Orange Man (★★★★★ -VueWeekly) and Blindside (★★★★★ -CBC.) Daughters of the now-defunct Merkin Empire, these formerly-famous Canadian sisters leave the house for the first time in a decade to present their Ultimate Piece of Art. Think the Olsen Twins + Grey Gardens + the Muppets.<br><br>&ldquo;HILARIOUS, TERRIFYING, &amp; STRANGELY AROUSING.&rdquo; - Jon Bennett.",
        "img": "THEMERKINSISTERS_2017_450x450v02.jpg",
        "artist": "SNAFU / Toronto",
        "artistLocation": "Ontario, Canada"
    },
    "95": {
        "title": "Mike Delamont: Mama's Boy",
        "description": "5 STARS  &ldquo;An almost supernatural gift for storytelling... A spectacular evening of theatre!&rdquo; CBC.<br><br>From 18 time 'Best of the Fest' winner Mike Delamont and the acclaimed director of Jakes Gift comes the emotional, powerful, and heartbreaking true story of family, music, addiction, and love.<br><br>5 STARS &ldquo;Equally full of belly laughs as it is of tears, and will leave you with a renewed zest for life!&rdquo; VUE Weekly",
        "img": "MamasBoy_2017_450x450.png",
        "artist": "Mike Delamont",
        "artistLocation": "Victoria, British Columbia, Canada",
        "warnings": [
            "Course Language",
            "Adult Content"
        ]
    },
    "96": {
        "title": "A Mixture of Minced Meat, Onion, and Spices: Served Piping Hot",
        "description": "Join us on a journey to find Pancake, the missing hound.",
        "img": "AMixture_450x450.PNG",
        "artist": "Bad Mujeres",
        "artistLocation": "Orlando, FL"
    },
    "97": {
        "title": "Mo' Manada!",
        "description": "After wowing Orlando Fringe audiences last year with their hit show Oh Manada! Canada&rsquo;s premiere all-male burlesque troupe returns with a hot new sequel featuring more hot Canadian hunks, more hockey players, more lumberjacks, more butts and Mo&rsquo; Manada! Studly Prime Minister Justin Trudeau decides that the only way to save America after a tense year in politics is with a covert team of Canadian strippers specially trained in naked diplomacy, hand-to-butt combat, and international sex-pionage.",
        "img": "MoManada2017_TIXWEBSITE_450x450_72dpi.PNG",
        "artist": "BoylesqueTO",
        "artistLocation": "Toronto, Ontario, Canada"
    },
    "98": {
        "title": "Molly's Comedy Cabaret",
        "description": "A 60-minute comedic romp featuring the power house vocals of Canadian actress and singer Molly Wilson. From Broadway to pop to Motown, there is never a dull moment -- and every show features a strong likelihood of puppetry! This show is full of fun and fanciful entertainment that will keep you laughing from start to finish. Come see why audiences are saying, \"She is amazing. Also adorable. I could listen to her all day!\"",
        "img": "MollysComedyCabaret_2017_450x450.png",
        "artist": "Molly Wilson",
        "artistLocation": "Chilliwack, British Columbia, Canada"
    },
    "99": {
        "title": "Mustardseed",
        "description": "A fairytale for grown-ups with lullabies for the disenchanted, Mustardseed is an immersive bedtime story from Ryan Good, award winning, spandex clad storyteller. Unleash your inner baby dragon on a journey through magical forests, the fog of depression and pillow forts raves. With an original score of soothing songs from Dirty Little Blondes that will kiss away the everyday stresses of work and bills and what you&rsquo;re going to be when you grow up.",
        "img": "Mustardseed 450x630@72DPI.jpg",
        "artist": "Lucy Tafler Presents",
        "artistLocation": "Copthorne, United Kingdom",
        "warnings": [
            "Strong Language",
            "Adult Content"
        ]
    },
    "100": {
        "title": "New Orleans: The Beginnings",
        "description": "In 1840s New Orleans, cotton is king and money flows freely along the Mighty Mississippi. But all is not as it seems. Different factions of society battle for control of the city. Do your loyalties lie with the elegant Creoles, the seductive vampires, the roguish vagabonds, the adventurous pirates, or the voodoo practitioners? Choose wisely, because in this interactive thriller, you are in control, and one wrong move could spell disaster.",
        "img": "NewOrleansTheBeginnings_2017_450w_72dpi.png",
        "artist": "Gini Lynn Productions LLC",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Strong Language",
            "Adult Content"
        ]
    },
    "101": {
        "title": "Now With Chikin",
        "description": "When rumps are on the line, what lengths will two cows with a paintbrush go to ensure that people eat a little more chicken? And isn&rsquo;t sacrificing the lives of chicken a bit morbid to begin with? Delve into the minds &amp; lives of those roadside bovines we've come to know and love in this hilarious &amp; fast paced satire.<br>-From the Producer of 2016's DORO &amp; DIEGA and written by the playwright of THE FOREPLAY: An Exploration of the Birth of Our Nation.",
        "img": "NowWithChikin_2017_450x450_TicketingSite.png",
        "artist": "Sprocket Stage Company",
        "artistLocation": "Kissimmee, FL",
        "warnings": [
            "Adult Language"
        ]
    },
    "102": {
        "title": "Ominous George",
        "description": "Heavy metal black comedy. Evil cabaret. Regrets that go up to 12. An original rock &amp; roll recital by a sarcastic antihero who dives face-first into the empty swimming pool that is his mind.<br><br>From Steve Schneider, creator of Fringe hits The Wait List Murders (Patrons Pick 2015) and Escape from Baldwin Park (Orlando Sentinel Best of Fest 2014).<br><br>It's like Tony Orlando and Dawn... of the Dead!",
        "img": "OminousGeorge_2017_450x450.png",
        "artist": "carpenter Aunt Productions",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Some Language and General Hostility"
        ]
    },
    "103": {
        "title": "One Night at Louie's",
        "description": "In the summer of 1999, six friends find themselves living together sharing frustrations with their jobs at Pine Point, one of the world's largest amusement parks. Each night they head out to Louie's, a local bar where anything can happen, and return home only to wake up the next morning to do it all again the next day.<br><br>The drunken nights full of laughter, love and tears leave them wondering who and what will last after the summer is over.",
        "img": "OneNightatLouies_2017_450x450app.png",
        "artist": "One of Those Productions",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Language"
        ]
    },
    "104": {
        "title": "Orlando's Queen of Fringe 2017",
        "description": "Orlando's Queen of Fringe is a drag showdown looking for the next edgy and talented Queen that is fringy, fearless, ferocious, and fierce. This year, the Queens will perform in categories that will showcase their &ldquo;Natural Woman&rdquo; personas and instincts. Who will be Orlando&rsquo;s next Queen of Fringe? Join us at Savoy Orlando to find out.",
        "img": "QueenofFringe_2017_450x450.jpg",
        "artist": "Madame PeeVira / Peevish Productions",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Strong Language and Mature Themes"
        ]
    },
    "105": {
        "title": "The Other Woman: My Mother-in-Law",
        "description": "The Other Woman: My Mother-in-Law is an original comedic musical featuring four women who meet on a cruise and explore the trials of dealing with meddling mothers-in-law as they embark on their quest to self-empowerment and happiness. This show features original songs and dance, multiple genres of music, and jokes enjoyable for both women and men of all ages.",
        "img": "TheOtherWoman _2017_450xanysize.jpg",
        "artist": "Mirage Talent LLC",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Mature Topic on Self Empowerment"
        ]
    },
    "106": {
        "title": "O-TOWN: Voices from Orlando",
        "description": "Collected stories from the weeks and months following the Pulse Nightclub attack in Orlando. Created and Directed by David Karl Lee, recipient of The Orlando Fringe 2016 Lifetime Achievement Award",
        "img": "Otown_450x.jpg",
        "artist": "Ant Farm Productions",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "PG-13 Adult Language and Situations"
        ]
    },
    "107": {
        "title": "PeeVira's Scareavan Sing-along",
        "description": "Madame PeeVira (The Fringy Mime Queen) is back...\"baby one more time\" with an all new fringe show. Ride with her through the Orlando Fringe hub for a killer 1990's sing-along. Board a SCAREavan of nostalgia as she guides you on an absurd, raunchy, and fun 30 minute journey. Guests will sing-along to classic hits that made us jam out in our bedrooms and school dances...nothing scarier then that.<br><br><div class=\"alert alert-danger\"><strong>Please note that since this performance takes place in a personal vehicle and not a commercial performance space, it may not be accesibly by people with disabilities.</strong></div>",
        "img": "Killer90sMagCover_450x450.jpg",
        "artist": "Madame PeeVira / Peevish Productions",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Strong Language",
            "Adult Content"
        ]
    },
    "108": {
        "title": "Petunia and Chicken",
        "description": "From the creators of last year's DARLINGS comes a 2 person epic prairie love story inspired by the works of Midwest author Willa Cather.<br><br>Sprawling fields of wheat, bustling train stations, rain-soaked kisses, wind-blown hair, and the rest of Petunia and Chicken&rsquo;s world are brought to life with just a hat, a scarf, and song.<br><br>\"This show is hard to beat.\" -The Washington Post<br><br>\"A clever, sweet and imaginative journey.\" -NY Theater Now",
        "img": "PetuniaandChicken_2017_450by550.png",
        "artist": "Animal Engine",
        "artistLocation": "New York, NY"
    },
    "109": {
        "title": "Phantasmagoria's &quot;Wickedest Tales of All&quot;",
        "description": "Called &ldquo;One of the most unique theater troupes in the country.&rdquo; by Good Day Atlanta, Phantasmagoria returns to Fringe with its all new touring show &ldquo;Wickedest Tales of All&rdquo; - Haunted Storytelling, Phantastical Dance, explosive stage combat and puppetry all woven into a tapestry of macabre and whimsical horror. Featuring works by Poe, Dickens, and tales of legend and folklore, this acclaimed Victorian Horror Troupe is sure to chill and thrill all audiences!",
        "img": "Phantasmagoria.WickedestTalesofAll_2017_450x450.png",
        "artist": "Phantasmagoria / John DiDonna",
        "artistLocation": "Sanford/Orlando, FL"
    },
    "110": {
        "title": "Pillow Talk",
        "description": "The story of Aaron and Doug, best friends, who are on a road trip across America. They stop for the night at Aaron&rsquo;s dotty old grandmother&rsquo;s house in an Arizona trailer park. The small mobile home, which is also inhabited by Pookie (Grandma&rsquo;s pet ferret), has only one bedroom, so the guys are forced to share a bed for the evening. Hampered by Doug's phobic fear of physical intimacy, the duo are forced to examine their feelings about friendship and each other. With the battle lines drawn, they get little sleep and a night full of surprises.",
        "img": "PillowTalk_2017_450x450_72dpi.png",
        "artist": "C.P. Productions",
        "artistLocation": "College Park, Orlando, FL",
        "warnings": [
            "Nudity",
            "Mature Themes"
        ]
    },
    "111": {
        "title": "The Pink Hulk: One Woman's Journey to Find the Superhero Within",
        "description": "What&rsquo;s the first thing Valerie does when she&rsquo;s diagnosed with cancer again? She tries to get laid. Battling breast cancer after fighting off lymphoma, Valerie&rsquo;s afraid she might lose &ldquo;the girls&rdquo; and pursues one last hurrah. Does she succeed? Come see it to find out! This sexy, adventurous solo show follows the triumphant journey of Valerie seeking her own \"hulk-like\" strength to find her superhero within!",
        "img": "ValerieDavidThePinkHulk450pix.jpg",
        "artist": "Valerie David",
        "artistLocation": "New York, NY",
        "warnings": [
            "Sexual Themes",
            "Strong Language",
            "Mature Content"
        ]
    },
    "112": {
        "title": "Poe Man",
        "description": "The Tell-Tale Heart, Hop-Frog and The Raven. Solo performer John Devennie returns to the Orlando Fringe and brings Poe's work to life in a way that will have you on the edge of your seat. Sorrow, desperation and revenge are the themes in a literary world where no one is safe.",
        "img": "PoeMan_2017_450.png",
        "artist": "John Devennie",
        "artistLocation": "Orlando, FL"
    },
    "113": {
        "title": "Problem Is...",
        "description": "We all face life at sixty minutes an hour, twenty four hours a day, seven days a week. Who's controlling your time? You? OR, those that influence you? Do you wake up in your life or someone else's?<br>No matter the beat to which your clock ticks, the problem is you think you have time.",
        "img": "Problem450.png",
        "artist": "Red Right Return Dance Company",
        "artistLocation": "Orlando, FL"
    },
    "115": {
        "title": "Punslingers: A Western Wordplay Musical",
        "description": "From the creators of Orlando's hit show \"Punslingers: A Game Show for Word Nerds\", this comedy musical explores the Wild West of Wordplay. Lame puns, groaners, and Dad-jokes serve as the punchlines as we bend the English language until it snaps!",
        "img": "PUNSLINGERS_2017_Ticketing450xNoLimit.png",
        "artist": "Sam Hammersley",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Adult Language"
        ]
    },
    "116": {
        "title": "QUICKIES by Tracey Jane Smith",
        "description": "Explore the unexpected ups and downs of love as this smart, sexy ensemble presents four original plays by Tracey Jane Smith: Sex and a Story (The foreplay that launched One Thousand and One Nights.) Meet the Pets(Approval must be earned.) Buried (The deepest love is the hardest to bury.) Welcome to Intercourse (On the road to love, sometimes you just need a sign.) Directed by Robert Cunha. Recommended 18+ for sexual innuendo. Free parking.",
        "img": "quickies_winter_square.png",
        "artist": "Equal Play",
        "artistLocation": "Oviedo, FL",
        "warnings": [
            "Strong Language",
            "Mature Themes"
        ]
    },
    "118": {
        "title": "The Rocky Horror Pole Show",
        "description": "The Rocky Horror Pole Show provides all the delectable sweetness that made RHPS a cult classic while adding the sensual twist of pole dance along with the glitter and fishnets you've come to expect! Perhaps you have seen Rocky Horror live but if you have never seen Frank-N-Furter on a pole we hope you shiver with antici.......pation and enjoy this one of a kind show letting your freak flag fly high while madness takes its toll.",
        "img": "RockyHorrorPoleShow_2017-450.jpg",
        "artist": "MissFit Pole Production",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Mature Themes"
        ]
    },
    "119": {
        "title": "Roller Coaster",
        "description": "Fringe touring circuit veteran TJ Dawe (Burn Job, Medicine, Marathon, The Slipknot, Lucky 9 and many other shows)(he's been doing the Fringe in O-town since 2001)(and directed a bunch of shows too) returns with stories and thoughts about Islands of Adventure, America&rsquo;s 45 president, author Barbara Ehrenreich, and who our true gods are.<br><br>&ldquo;A master story-teller&rdquo; - Orlando Weekly<br><br>&ldquo;A flawless performer&rdquo; - Charleston City Paper.<br><br>This is TJ's 107th Fringe worldwide. Yes, really.",
        "img": "Rollercoaster_450.png",
        "artist": "TJ Dawe",
        "artistLocation": "Vancouver, British Columbia, Canada"
    },
    "120": {
        "title": "Roller Derby Saved My Soul",
        "description": "BACK BY POPULAR DEMAND! Amy, a shy comic book geek, navigates the world of roller derby and learns to unleash the hero within in this action-adventure comedy on wheels.<br><br>Canadian Comedy Award Nominee &ndash; Best One Person Show<br>Patron&rsquo;s Pick &ndash; Ottawa, Winnipeg, Vancouver<br><br>\"Like a sneak peek into Superman&rsquo;s phone booth.\" - Orlando Sentinel<br>&ldquo;Kenny is a charmer&hellip; undeniably original.&rdquo; &ndash; Montreal Gazette<br>&ldquo;Makes us want to lace up a pair of skates and, like this play, kick some ass.\" - Fully Fringed",
        "img": "RDSMS2017_450x450.png",
        "artist": "Broken Turtle Productions",
        "artistLocation": "Ottawa, Canda",
        "warnings": [
            "Strong Language"
        ]
    },
    "121": {
        "title": "Scientist Turned Comedian",
        "description": "You know how Larry the Cable Guy's act pretty much consists of him yelling \"Git 'er done!\" every five minutes or so? Scientist-turned-comic Tim Lee's material is the diametric opposite. Lee, who got his PhD before realizing where his true talents lay, blends science talk (complete with PowerPoint presentations) with comedy. The hilarious result is like what would happen if you crossed your high-school chem teacher with George Carlin<br>-Boston Phoenx",
        "img": "scientistTurnedComedian_2017_450x450.png",
        "artist": "Tim Lee",
        "artistLocation": "Los Angeles, CA"
    },
    "122": {
        "title": "Sex Ed",
        "description": "We're all taught from a young age - first comes love, then comes marriage, then comes the baby in the baby carriage. For some people, those instructions can be a little confusing. Kerry Ipema will take you on a brief education through one woman's coming of age with a little musical help from<br>Disney.<br> From the star and co-creator of One Woman Sex and the City Kerry Ipema gives you a lesson about Sex Ed with dramaturgy by Fringe star TJ Dawe.",
        "img": "SexEd450x450.png",
        "artist": "Kerry Ipema",
        "artistLocation": "New York, NY",
        "warnings": [
            "Mature Audiences"
        ]
    },
    "123": {
        "title": "SHAME",
        "description": "You are cordially invited to the most lavish event of the year. SHAME is a site-specific performance that is driven by you, the audience. So, arrive at the site, and be ready to have the time of your life.<br>Have fun and DON'T be late.",
        "img": "SHAME_2017_450x600.png",
        "artist": "Kathleen Capdesuner",
        "artistLocation": "Winter Park, FL"
    },
    "124": {
        "title": "Shirley Gnome: Taking It Up The Notch",
        "description": "Last year's Patrons' Pick (Blue Venue) returns with a brand new show of dark, hilarious and clever songs by \"the Queen troubadour of intelligent black-comic sex balladry\" (Edmonton Journal).<br><br>Taboo tribulations and sexual liberation are wrapped up in a folk/country, soft-rock one woman cabaret. A wickedly inventive blend of comedy and biting social commentary.<br><br>★★★★★ &ldquo;simply brilliant&rdquo; - Three Weeks, Edinburgh Fringe.<br><br>\"Good\" - The Orlando Sentinel",
        "img": "shirleygnome_2017_450.jpg",
        "artist": "Heartichoke Arts/Shirley Gnome",
        "artistLocation": "Surrey, British Columbia, Canada",
        "warnings": [
            "Strong Language",
            "Nudity",
            "Mature Themes"
        ]
    },
    "125": {
        "title": "Show Up",
        "description": "Peter Michael Marino (\"Desperately Seeking the Exit,\" \"Late with Lance!\") uses his decades of solo performance expertise to turn the often vilified clich&eacute;s of the genre on their heads. Pete uses an arsenal of Post-it notes to transform the real-life experiences of the audience into a vibrant life-story that's familiar and daring each time. You get to control the set and sound for this socially-anxious show about you. And there&rsquo;s a party!",
        "img": "showup_2017_450x450.png",
        "artist": "Peter Michael Marino",
        "artistLocation": "New York, NY",
        "warnings": [
            "Strong Language"
        ]
    },
    "126": {
        "title": "Snack",
        "description": "In the hustle and bustle of the big city, who has time to eat? Can love be found in a cup of coffee? And who invited the dancing bananas?! Olrando's only non-verbal theatre company brings this fan favorite to Fringe for the first time! \"Comedy can't do better than that\", proclaims Elizabeth Maupin. \"A show jaded adults and wide eyed kids can enjoy equally\", declares Seth Kubersky. Laugh off some Fringe calories and see why food is so funny!",
        "img": "snack_2017_450x450.png",
        "artist": "Gromalot Theatre Factory (formerly PB&J)",
        "artistLocation": "Orlando, FL"
    },
    "127": {
        "title": "Soap Opera - Sloppy Seconds",
        "description": "All you need is love, right? After things don't work out with 2016 Divo season winner, Butterfly, once-again, bachelor, Don Giovanni returns to the hit show to give love a sloppy second chance. A show in a show, this sequel to 2016 Fringe success, Soap Opera, expertly melds opera and musical theater with original script. Sloppy Seconds will keep our audiences' ears buzzing and hearts laughing!",
        "img": "SoapOperaSS_2017_450Wide.jpg",
        "artist": "Central Florida Vocal Arts",
        "artistLocation": "Winter Park, FL",
        "warnings": [
            "Strong Language",
            "Mature Themes"
        ]
    },
    "128": {
        "title": "Something Strange",
        "description": "Inspired by Netflix&rsquo;s Stranger Things, Something Strange is an improvised play set in 1984 small town America where some mysterious and other-worldly event throws everyday life into chaos. Citizens of the town will band together, or split apart, as they come to terms with the dark secrets lurking in their own backyard. With a different town and different set of strange happenings every show, no performance will be the same.",
        "img": "SomethingStrange_2017_450x450px.png",
        "artist": "William Travis Ray",
        "artistLocation": "Winter Park, FL",
        "warnings": [
            "Language"
        ]
    },
    "129": {
        "title": "The Spielers",
        "description": "When the leader of an expedition goes missing inside an ancient temple, it's up to a motley crew of tour guides to find him and save the world. Simply put, \"The Spielers\" is the early 2000s movie adaptation of some certain guided tour theme park rides we never asked for, complete with bad puns, gender neutral names, and a roster of modestly impressive special effects... When they work.",
        "img": "TheSpielers_2017_450x450.png",
        "artist": "Spieler Productions",
        "artistLocation": "Winter Garden, FL",
        "warnings": [
            "Adult Themes and Language"
        ]
    },
    "130": {
        "title": "St. Matthew's Tavern Fringe Kickoff",
        "description": "Kick off the start of the Festival at St. Matthews Tavern! Drink specials for Fringe Artists, games and performances.",
        "img": "STMATT_WELCOME_450X450.png",
        "artist": "St. Matthew's Tavern",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Alcohol"
        ]
    },
    "131": {
        "title": "Stardust After Dark",
        "description": "Plug headphones into your smartphone and journey into Stardust After Dark. Choose to dance with lustful fairies or drink with lewd pirates. Free yourself and give in to your desires. This adult themed two track audio drama will take you on a dark and sensual voyage around the Orlando Urban Trail. Will you answer the Siren's call?",
        "img": "StardustAfterDark_2017_450pxX450px.png",
        "artist": "Phoenix Tears Productions",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Strong Language",
            "Adult Content"
        ]
    },
    "132": {
        "title": "Stardust Kingdom",
        "description": "Pop headphones in your smartphone and step into the Stardust Kingdom! Choose your guide, either a bubbly fairy or fearless pirate, and be lead around the Orlando Urban Trail on an adventure to save the kingdom from the evil queen. This two track audio drama is guaranteed to be a heartwarming theatrical experience for all ages.",
        "img": "StardustKingdom_2017_450pxX450px.png",
        "artist": "Phoenix Tears Productions",
        "artistLocation": "Orlando, FL"
    },
    "133": {
        "title": "Stewart Huff Presents The American Heretics Comedy Tour",
        "description": "2-time Fringe Best Comedy winner Stewart Huff (Donating Sperm to My Sister&rsquo;s Wife, Sense Ain&rsquo;t Common) returns w/ Tom Simmons &amp; Jay Whitecotton. Jokes in the style of Mark Twain w/ the bite of George Carlin, this tour is &ldquo;doing the material that got us banned, threatened, violently attacked and/or not hired back. Basically, we&rsquo;re doing the fun stuff.&rdquo;",
        "img": "Stewart Huff Presents The American Heretics Comedy Tour_450X450_72dpi.png",
        "artist": "Stewart Huff",
        "artistLocation": "Athens, GA",
        "warnings": [
            "Coarse Language",
            "Progressive Ideas"
        ]
    },
    "134": {
        "title": "The Struggle is Real",
        "description": "Runaways are official selections of The Atlanta Improv Festival 2016, Tampa Bay Improv Festival 2016, and Miami Improv Festival 2016.<br>Runaways&rsquo; inaugural sketch show invites you to laugh along with us through time as we explore a variety of lenses that amplify, distort and filter the struggle. Warning: objects may be closer than they appear. Real women. Real comedy. Don't touch that dial.",
        "img": "thestruggleisreal_2017_450x450.png",
        "artist": "Runaways",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "May Include Adult Language",
            "Themes"
        ]
    },
    "135": {
        "title": "Stupid and Contagious",
        "description": "Here we are now, ENTERTAIN US! From Kurt Cobain look-alike Ryan Good (2016 Patron&rsquo;s Pick) comes a karaoke cabaret mosh pit of immersive Nirvana theatre. Climb inside the band that defined 90s rock god and headbang in the aisles like your flannel shirt depends on it. This is a concert. You are the band.<br>&ldquo;A truly creative, original, and uplifting show. A must see&rdquo; Krystoff Magazine<br>&ldquo;Heartfelt, hilarious, and worth every penny&rdquo; Australia Times",
        "img": "S&C_450x630@72DPI.jpg",
        "artist": "Lucy Tafler Presents",
        "artistLocation": "London, United Kingdom",
        "warnings": [
            "Strong Language",
            "Mature Themes"
        ]
    },
    "136": {
        "title": "A Tension to Detail",
        "description": "\"He just rambled on and on and on and I never wanted him to stop\" - Audience review, Montreal<br><br>British comic Gerard Harris brings a global storytelling hit that&rsquo;s equal parts philosophical, psychological and scatological. Mixing the deeply personal with the seriously frivolous, we look at the tales we tell ourselves as writers of our own stories. We'll also learn about the functionality of the Bulldog brain and the best way to dispatch a lobster into eternity.<br>Best Comedy, Dunedin Fringe (NZ)<br>Best of Fest, Ottawa Fringe (CA)",
        "img": "A Tension To Detail_2017_450wide.png",
        "artist": "That's Enough Drama / Gerald Harris",
        "artistLocation": "London, United Kingdom",
        "warnings": [
            "Strong Language",
            "Mature Themes"
        ]
    },
    "137": {
        "title": "ThanksKilling The Musical",
        "description": "Based on the 2009 movie Thankskilling, this comedy musical follows five unsuspecting teens through a Thanksgiving homecoming from hell. Starring \"Turkie\", the Homicidal Turkey, Thankskilling is Stuffed with Gore, catchy tunes, and an occasional nip slip. Don't forget to bring your favorite adult beverage for the \"Horror Cliche Drinking Game\". Thankskilling is bound to make you gobble with excitement.",
        "img": "ThanksKilling The Musical_2017_450x450px.png",
        "artist": "Johnnie Maier",
        "artistLocation": "Winter Grden, FL",
        "warnings": [
            "Language",
            "Violence",
            "Adult Themes"
        ]
    },
    "138": {
        "title": "Theodore's Super Fun Adventure: a divinely sexy comedy",
        "description": "Writer of &ldquo;Everybody Loves Chlamydia&rdquo; Bobby DeSormier returns to bring you more emotion, excitement, and deep belly laughs than before. Returning from a brief hiatus in California renowned director Chad Lewis brings his magic with a host of characters hand-picked by destiny.",
        "img": "Theodore_2017_w450px-72dpi.jpg",
        "artist": "Bobby DeSormier",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Mature Themes",
            "Nudity",
            "and Language"
        ]
    },
    "139": {
        "title": "There Ain't No More: Death of a Folksinger",
        "description": "A raucous one-man operetta based on legends of American folk music and the early vaudeville stage. A bawdy old folksinger tries to burn the barn down one final time before his last waltz is called. Facing the life he has led and the legacy he will leave behind, he uses every trick he knows to confront his past. Experience an authentic and sometimes troubling American music tradition on five instruments with clowning, puppets, dirty jokes, and a crankie in this haunting and heartfelt hootenanny. It's ragged, but right!",
        "img": "There_Aint_No_More_2017_450x300.png",
        "artist": "Willi Carlisle",
        "artistLocation": "Fayetteville, AK",
        "warnings": [
            "Strong Language",
            "Mature Themes"
        ]
    },
    "140": {
        "title": "This Side of Heaven",
        "description": "\"After two unlucky accidents, seventeen-year-olds Fever and Chase must adapt to the new limitations of their bodies: partial-paralysis for Chase and a permanent limp for Fever. Through a series of vignettes chronicling their weekly physical therapy appointments, the two also struggle to accept the reality of being disabled for the rest of their lives. With humor, honesty, and romance, Fever and Chase find a new sense of themselves in each other.\"",
        "img": "thissideofheaven_2017_450x500.png",
        "artist": "Winter Springs High School",
        "artistLocation": "Winter Springs, FL"
    },
    "141": {
        "title": "Til Death: The Six Wives of Henry VIII",
        "description": "It all starts in a bizarre waiting room in the afterlife room. One by one, the wives of Henry VIII arrive, much to the shock and dismay of each previous wife. What culminates is a heated frenzy of an ex-wives club where these women swap stories, toss Anne Boleyn&rsquo;s head around, pick on the ugly German one and fight for the right to be acknowledged as Henry&rsquo;s true bride and eternal partner.<br><br>But when Henry arrives, everything changes!",
        "img": "TilDeathOrlando_450x900.jpg",
        "artist": "Monster Theare",
        "artistLocation": "Vancouver, British Columbia, Canada",
        "warnings": [
            "Some Language",
            "Sexuality"
        ]
    },
    "142": {
        "title": "Titus Andronicus Holiday Special",
        "description": "Many people die. Often repeatedly.",
        "img": "Titus_Andronicus_2017_450px.png",
        "artist": "Arfnotz Productions",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Language",
            "Sexual Situations",
            "Puppets"
        ]
    },
    "143": {
        "title": "Tod Kimbro and Blue Star Do a Cabaret",
        "description": "It's just this simple. BLUE Star and TOD Kimbro SING SONGS and call it a CABARET and DRINK WINE while doing it! Comedy, Great Music and Wine all in one LIVE SHOW!",
        "img": "TodAndBlue_450.png",
        "artist": "Tod and Blue present things",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Strong Language",
            "Mature Themes"
        ]
    },
    "144": {
        "title": "Trading Soles",
        "description": "BEN, an awkward freshman, meets his new roommate in college, ELI, an arrogant, charming sophomore. BEN and ELI are complete opposites and do not get along due to their differences. Ben has enough and tries to move out of the dorm, but thats when the chaos begins. Just when things couldn't get worse, they switch bodies. BEN and ELI have no choice but to come together and figure out what in the world just happened.",
        "img": "TRADING_SOLES_2017_450x450.png",
        "artist": "Magna Verum Productions",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Strong Language",
            "Sexual Themes",
            "Violence"
        ]
    },
    "145": {
        "title": "The Trojan Women",
        "description": "A modern adaptation of a classic tale with original acapella music compositions. Immediately following the destruction of Troy at the hands of the Greeks, the women are gathered as prisoners outside the city walls. The lone survivors of a revered civilization, these women await their fates as slaves and concubines to their invaders. Watched over by Poseidon, their cherished deity, both women and the gods are helpless in securing their survival.",
        "img": "TheTrojanWomen_2017_450wide-72dpi.png",
        "artist": "East River High School",
        "artistLocation": "Orlando, FL"
    },
    "146": {
        "title": "Tween Earth and Sky",
        "description": "From a clever lad&rsquo;s attempt to outwit a leprechaun, to stones which weep tears of regret over an ill-stared romance, a ruined aristocrat&rsquo;s desperate bargain with the Devil and a harrowing journey with a talking corpse, Mark Lyon&rsquo;s tour-de-force dramatization of four Irish tales of the supernatural weave an unforgettable spell of enchantment.<br><br>&ldquo;He is a master storyteller.&rdquo; Victoria Times Colonist<br><br>&ldquo;A born storyteller&rdquo; Prince George Free Press",
        "img": "TweenEarthandSky_450.png",
        "artist": "Windwhistle Theatre",
        "artistLocation": "Nevada City, CA"
    },
    "147": {
        "title": "The Ugly American Sings",
        "description": "It's history, where facts came from.<br>It's what we divided people have in common.<br> A Liberty Tree is where patriots came to hear the news during the Revolution.<br>Come hear the comedy songs of Ron Ross as the good, the bad and the ugly of<br>American history meet under a Liberty Tree behind the Shakespeare Center.<br>Sing along and share the guilt.<br>The Civil War was never so civil.<br>The Great Depression never felt so good.<br>British oppressors are welcome!",
        "img": "TheUglyAmericanSings_2017_450x450png.png",
        "artist": "Ron Ross Presents",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Strong Language"
        ]
    },
    "148": {
        "title": "Umbilicus",
        "description": "In this absurdist comedy, a man plagued with self-doubt seeks answers from a befuddled therapist who begs the question: What&rsquo;s the smartest thing you&rsquo;ve ever done? After a rigorous and fruitless session, both patient and therapist realize that maybe \"being smart\" isn't all it's cracked up to be.\"",
        "img": "Umbilicus_2017_450x450.png",
        "artist": "Badger Performing Arts",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Mature Themes"
        ]
    },
    "149": {
        "title": "Unbelievable",
        "description": "Award-winning Orlando Fringe veteran and activist, Logan Donahoo, is back in an ALL NEW one-man, multimedia comedy romp; learn how to not just survive, but THRIVE in the next 4 years!<br><br>Learn how to organize like a pro, how to (legally) cause a scene to effect political change, how to argue when someone is wrong on the internet, and - most importantly - how to NOT burn out!<br><br>Do NOT miss it!",
        "img": "UNBELIEVABLE_450x450.png",
        "artist": "Logan Donahoo",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Adult Language",
            "Video Imagery"
        ]
    },
    "150": {
        "title": "Uncertainty",
        "description": "If you travelled back in time and met yourself, would you believe what you said? This is the question posed in the new play \"Uncertainty\" by longtime Fringe veteran Eric Pinder (\"Driving Miss Cherry Blossom\" and Patron's Pick \"Skip Peril\") In this comedy with dramatic overtones, a high school senior is confronted by his future self but isn't allowed to know why.<br><br>Featuring Clark Levi and Eric Pinder as the same person from different ends of the space-time continuum, the show ponders the question of what we could do differently while still being true to our own natures.",
        "img": "uncertainty_2017_450x450.png",
        "artist": "Eric Pinder",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Language",
            "Adult Themes"
        ]
    },
    "151": {
        "title": "The Unrepentant Necrophile",
        "description": "A mortician falls in love with a man as she prepares his corpse for burial. She has three days until the funeral&hellip; but three days just isn't enough. A punk-rock musical inspired by the notorious 1978 interview with necrophile Karen Greenlee.<br><br>\"As unapologetic a piece of theater as I&rsquo;ve ever seen. It takes a true story and tells it in an amazingly unique way, without commenting on its admittedly difficult subject matter.\" -Cincinnati City Beat<br><br>18 &amp; Up - Mature Themes, Strong Language",
        "img": "THE_UNREPENTANT NECROPHILE_2017_450PX635P72dpi.png",
        "artist": "The Coldharts",
        "artistLocation": "Brooklyn, NY"
    },
    "152": {
        "title": "Van Gogh Find Yourself",
        "description": "Based upon the letters of Vincent and Theo and the Memoirs of Vincent&rsquo;s stay in Auvers-sur-Oise by Adeline Ravoux, DeForest sets the record straight on a true artist&rsquo;s personal struggle for humanity. You think you know the truth?<br><br>#VanGoghFindYourself, please.",
        "img": "VGFY_450by450_0rlando2017.png",
        "artist": "#VGFY",
        "artistLocation": "New York, NY"
    },
    "153": {
        "title": "VarieTEASE: Haunted",
        "description": "The year is 1920. America has become a world power. Economic prosperity abounds, jazz blossoms and New York is layered in art deco. The unprecedented industrial growth, such as motion pictures and electricity has accelerated people's aspirations. Women have gained the right to vote and flexing their newfound independence. Three sisters and their social climbing mother their visit a mysterious suitor at his old mansion on a very stormy night.",
        "img": "Haunted _2017_450_wide.png",
        "artist": "BlueLaLa Entertainment and FatSTAR Productions",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Adult Themes",
            "Sexual Content"
        ]
    },
    "154": {
        "title": "Vasily Djokavich Russia's #1 State Approved Comedian",
        "description": "The 2016 fringe hit returns! 4.5 STARS &ldquo;Strong like bull, but funny... like ox!&rdquo; Winnipeg Free Press. From the director of God Is A Scottish Drag Queen and award winning comedian Morgan Cranny comes a hilarious, silly, and deadpan hour of comedy! Join Vasily Djokavich, Russia's #1 state-approved comedian, as he embarks on a cultural exchange of America.<br><br>4 STARS &ldquo;The best shtick to ever hit the fringe!&rdquo; Edmonton Journal.<br><br>*****",
        "img": "VasilyDjokavich_2017_450x450.png",
        "artist": "Morgan Cranny",
        "artistLocation": "Victoria, British Columbia, Canada",
        "warnings": [
            "Implied Course Language"
        ]
    },
    "155": {
        "title": "Vincent",
        "description": "Vincent is an all new original bromantic (brom-com if you will) comedy about a dog and cat that are quite reluctant to show respect for a different species. A \"Step-Brothers\" like spin on of the oldest rivalries of all time. Cats and dogs. They don&rsquo;t like each other. They can&rsquo;t stand each other and they just moved in with each other.<br><br>Written by Rauce Padgett, Micheal Thibodeau and Lindsay Taylor.",
        "img": "Vincent_2017_450wide.png",
        "artist": "Rauce like Sauce Productions",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Mature Themes"
        ]
    },
    "156": {
        "title": "Walking Into the Woods",
        "description": "A show created entirely around the moment you need to escape and connect.<br>Where you both hide and seek. Where you build a world to find yourself and start healing wounds in your natural enviroment.<br>This improv dance show is performed outside, with a different live musician every show to aid the flow of the moment, to co create with the artist and the audience, and to capture the authenticity of every performance.",
        "img": "WalkingIntotheWoods_450.png",
        "artist": "Michelina Wingerter",
        "artistLocation": "Orlando, FL"
    },
    "157": {
        "title": "WANZIE With A Z",
        "description": "The real-life journey of Actor/Playwright Michael Wanzie from age 6 to 60. Follow this multi-award-winning Fringe fave as he progresses from performing for hotdogs in Shelton CT to Magic Kingdom Jungle Cruise Skipper. Catholic to Mormon to Atheist. Closet-case to Gay Activist. Muppet to Producer. Lisping outcast to Radio Personality. Single to Still Single. Featuring Josh Roth, Josh Lefkowitz &amp; Wanzie. Comedy Drama Singing &amp; Dancing!<br><br>You&rsquo;ll laugh - You&rsquo;ll Cry - It&rsquo;s Practically CATS!",
        "img": "Wanzie_2017_450x450.png",
        "artist": "Wanzie Presents & D Squared Productions",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Strong Language",
            "Sexual Themes"
        ]
    },
    "158": {
        "title": "Wanzie's Two Men Trapped in Women's Bodies",
        "description": "Fringe Icons &amp; multi-Patron&rsquo;s Pick Winners, Doug Ba&rsquo;Aser &amp; Tommy Wooten are hard-living ex-hippies barely surviving the 80&rsquo;s in Wanzie&rsquo;s Hi-Camp Comedy Revival voted &ldquo;Favorite Fringe Show&rdquo; 1998 People&rsquo;s Choice Award!<br><br>Tommy &amp; Doug each play mothers, Marge &amp; Judy and their respective sons in this fast-paced hilarious tale of Booze, LSD, The Magic Kingdom, Camels, Crescent Rolls, Prison Rape, Friendship, Janis Joplin &amp; Funeral Hijinks!",
        "img": "TwoMenTrapped_2017_450x450.jpg",
        "artist": "Pot Luck Productions",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Adult Themes"
        ]
    },
    "159": {
        "title": "&quot;We Burned Down the White House&quot; and other Canadian Folk Songs - by Charles Martin",
        "description": "Join the &ldquo;Canadian Charles Martin&trade;&rdquo; as he guides you through an offensive, hilarious and apologetic journey through Canadian music. Though little known here in America, you will sing along to popular Canadian radio hits such as &ldquo;Toronto Sucks&rdquo;, &ldquo;I Can&rsquo;t Stand You Anymore&rdquo;, &ldquo;Run Run Piggy&rdquo;, the Quebec National Anthem: &ldquo;Bonjour Monsieur Tibeault&rdquo; and the beloved Canadian classic &ldquo;The War of 1812&rdquo; by Pierre Berton and Leonard Cohen.",
        "img": "Burned_down_the_White_house_2017_450x450.png",
        "artist": "Wes Borg",
        "artistLocation": "Victoria, British Columbia, Canada",
        "warnings": [
            "Strong Language and Mature Themes"
        ]
    },
    "160": {
        "title": "We Don't Play Fight",
        "description": "An historic blend of the arts expressed! The actors act, and the wrestlers wrestle. Two worlds working together sharing the ring and stage for one night only! A story about a blind wrestling promoter getting one last shot to earn his job back with the big leagues. A tryout that consists of 4 separate days and hours on LIVE television and Pay Per View! A rare miraculous opportunity,to share his vision with you the fans in attendance and the rest of the world watching at home.",
        "img": "WeDontPlayFight_2017_450x450.png",
        "artist": "CONQUER Pro Westling",
        "artistLocation": "Orlando, FL"
    },
    "161": {
        "title": "Weaksauce",
        "description": "Weaksauce is the story of the summer Sam turned 16... a coming-of-age comedy of first times, second chances and third wheels.<br><br>**Canadian Comedy Award Winner - Best One-Person Show**<br><br>&ldquo;He&rsquo;s a first-rate storyteller and comedian, whose life-mined material is both hilarious and profound.\" -CBC<br><br>\"Weaksauce is hard not to fall in love with.\"<br>-The Star Phoenix",
        "artist": "Sam Mullins",
        "artistLocation": "Toronto, Ontario, Canada",
        "warnings": [
            "Language"
        ]
    },
    "162": {
        "title": "White Privilege II: A Performance",
        "description": "White Privilege II: A Performance is a lyrical interpretation of Macklemore's White Privilege II. The piece strives to provoke dialogue about his journey as a white rapper in a predominately black industry. This song was initially written with the intention of initiating conversation about race relations. We took the challenge of reinventing the work to reach a larger audience to continue this crucial work towards social change.",
        "img": "whiteprivilegeII_2017_450x600.jpg",
        "artist": "Professional Training Program",
        "artistLocation": "Jupiter, FL",
        "warnings": [
            "Mature Themes and Language"
        ]
    },
    "163": {
        "title": "Who, Me.",
        "description": "Doctor Who is about to face his greatest challenge: his number one fan.<br>Rob Lloyd from Doctor Who: Earth Conquest (BBC America) is putting The Doctor on trial.<br>Is Doctor Who (the television show) guilty of inciting in Rob a debilitating obsession, or has it shaped him into a well-rounded, mentally-sound member of society.<br><br>After SELL-OUT seasons in Australia, New Zealand, at the Edinburgh and Chicago Fringe Festivals, court is now in session",
        "img": "whome_2017_450x600pixels.png",
        "artist": "Rob Lloyd",
        "artistLocation": "Melbourne, Australia"
    },
    "164": {
        "title": "The Window School",
        "description": "This beautiful and heartwarming play is set in a one room school house in post Civil War Alabama. A courageous young woman, Miss Melly, believes all children should be able to attend school. And<br>when all doors are closed, she opens a window....<br><br>&ldquo;Once you learn to read, you will be forever free.&rdquo; ~Fredrick Douglass",
        "img": "windowschool 450x517at72dpi.jpg",
        "artist": "University High School",
        "artistLocation": "Orlando, FL"
    },
    "165": {
        "title": "Women in Revolt",
        "description": "Women want good marriages, peaceful funerals, unruffled relationships, successful careers. In \"Women in Revolt\" they get none of these. But you get two plays for the price of one. \"Frankie's Funeral\" (Will Mrs. Lavano be able to keep peace in a volatile mortuary?) and \"Marilyn Monroe Meets Adam Sandler\" (Will they get along?) A funny, heart-warming show.",
        "img": "WomenInRevolt_2017_450_1.png",
        "artist": "Actorville / Larry Stallings",
        "artistLocation": "Orlando, FL",
        "warnings": [
            "Strong Language"
        ]
    },
    "166": {
        "title": "Woody Sed",
        "description": "\"Woody Sed\" is new play about the life and times of Woody Guthrie. Everything that Woody saw he wrote about &ndash; from the dust bowl of Oklahoma to the orange groves of California, from the towers of New York City to Union rallies and the Merchant Marine, from Hobo Jungles to Hollywood. Woody Sed takes you there charting Guthrie&rsquo;s rise to fame and his struggle to escape a harsh and inevitable fate.",
        "img": "Woody_train_2017_450x450.jpeg",
        "artist": "Thomas Jones",
        "artistLocation": "Vancouver, British Columbia, Canada",
        "warnings": [
            "Historical Content",
            "No Foul Language"
        ]
    },
    "167": {
        "title": "Yellow Heaven",
        "description": "Ever have a bad day? Debi had one when she was 13 &ndash; and her mom gave her Valium. Whoa! Join Debi on a wild fantasy ride with TV demons &amp; literary thugs:<br><br>&bull; Barnabas Collins, Soap Opera Vampire<br>&bull; Edmund, Bodice Ripping Pirate<br>&bull; Hercule Poirot, The Greatest Detective Ever<br>&bull; Edgar Allen Poe, Poet<br><br>Debi shapeshifts into the bad-boy suitors of her imagination while weaving the story of her teenage drug addiction &amp; accidental spin into the light",
        "img": "YellowHeaven_450.png",
        "artist": "Debi Ham",
        "artistLocation": "San Francisco, CA"
    },
    "168": {
        "title": "Zombie Island OR How to Survive A Wedding With Your Ex",
        "description": "A tropical island. A weekend getaway. Everyone coming together to celebrate your friends' wedding in paradise. The only thing that could ruin it is... your ex. It's all right though, you'll just avoid each other. It's a big island.<br>Except that everyone else has turned into zombies and you're the only two left alive. And you thought pretending to like the bride was already hard&hellip;",
        "img": "ZombieIsland_2017_450.png",
        "artist": "Generation Productions",
        "artistLocation": "Orlando, FL"
    },
    "169": {
        "title": "A Year with Frog and Toad",
        "description": "Based on Arnold Lobel's well-loved books, this whimsical musical follows two great friends &ndash; the cheerful Frog and the rather grumpy Toad &ndash; through four fun-filled seasons.",
        "img": "frogandtoad_2017_450.png",
        "artist": "Lake Mary High School",
        "artistLocation": "Lake Mary, FL"
    }
}